package day12.practice;

public class VocabularyNoteEX3 {

	public static void main(String[] args) {
		Word wordList[] = {
				new Word("abc"),
				new Word("def", "def is define");
		};
		
		Voca
	}

	/** 기능 : 단어가 주어지면 단어장에 추가하는 메소드
	 * 매개변수 : 
	 * 리턴타입 : 
	 * 메소드명 :
	 */
	
	/** 기능 : 단어가 주어지면 단어장에서 삭제하는 메소드
	 * 매개변수 : 
	 * 리턴타입 : 
	 * 메소드명 : 
	 */
	
	/** 기능 : 단어가 주어지면 단어장에 해당 단어를 출력하는 메소드
	 * 매개변수 : 
	 * 리턴타입 : 
	 * 메소드명 : 
	 */
	 
	/** 기능 : 단어와 뜻이 주어지면 없는 단어이면 새로 단어를 추가하고
	 * 있는 단어이면 뜻만 새로 추가하는 메소드
	 * * 매개변수 : 
	 * 리턴타입 : 
	 * 메소드명 : 
	 */
	 
	/**
	 * 기능 : 단어와 수정할 뜻의 번호와 수정할 뜻이 주어지면 단어의 뜻을 수정하는 메소드
	 * * 매개변수 : 
	 * 리턴타입 : 
	 * 메소드명 : 
	 */
	
	/**
	 * 기능 : 단어와 수정할 단어가 주어지면 단어를 수정하는 메소드
	 * * 매개변수 : 
	 * 리턴타입 : 
	 * 메소드명 : 
	 */
}
